Revit 2027 API
TopographySurface.ArePointsEditable Property
 Identifies whether the points of this topography surface can be edited independently. Topography surfaces created from external data will not allow editing of individual points.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ArePointsEditable { get; }
Public ReadOnly Property ArePointsEditable As Boolean
	Get
public:
property bool ArePointsEditable {
	bool get ();
}
member ArePointsEditable : bool with get
Property Value
Boolean
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace